```
https://www.youtube.com/watch?v=SVjKsvvhWlQ&list=PLrpXwtuxGqcIIf_SpCWg04MoHf1yJUCvi
```

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([[3,2,5], [10,0,2],[6,5,3]]
                  ,columns=["사과", "자두", "포도"]
                  ,index=["이성계", "김유신", "이순신"])
s1 = df1["사과"]

* DataFrame 전체 또는 일부 칼럼을 대상으로 조건을 걸면 True, False 로 이루어진 테이블을 얻을수 있다.

In [4]:
# df1
# df1["사과"] > 3
df1[["사과","자두"]] > 3

        사과     자두
이성계  False  False
김유신   True  False
이순신   True   True

* 한개의 칼럼은 Series 타입이고 여러개 칼럼은 DataFrame 이다

In [10]:
s1 = df1["사과"]
print(type(s1))

s1 = df1[["사과","자두"]]
print(type(s1))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

* excel 파일을 읽어오려면 openpyxl 을 가져와야 한다.
* pip install openpyxl

In [ ]:
import openpyxl
df2 = pd.read_excel("../E00EXAMPLE.xlsx").set_index("이름")

In [24]:
df2

     국어  영어  수학  과학
이름
강동원  63  93  67  71
송중기  89  83  71  80
기태영  83  76  92  98
김남길  94  88  73  93
류준열  71  83  80  88
박성균  67  87  92  90

In [28]:
pd.Series([3,2,5], index =["이성계", "김유신", "이순신"] )

이성계    3
김유신    2
이순신    5
dtype: int64

E01EXAMPLE 사용
------------------------

In [45]:
import pandas as pd
# pd.set_option('display.max_columns', 10)                       # 출력할 열의 최대개수
# pd.set_option('display.max_colwidth', 20)                      # 출력할 열의 너비
# pd.set_option('display.unicode.east_asian_width', True)        # 유니코드 사용 너비 조정

In [11]:
df1 = pd.read_excel("../E01EXAMPLE.xlsx",sheet_name=1)
df2 = pd.read_excel("../E01EXAMPLE.xlsx",sheet_name=2)

In [ ]:
df1

In [54]:
df2

* VLOOKUP 구현

### VLOOPUP 구현
* 두가지 방법으로 merge 가능
```
df3 = pd.merge(df1,df2,how='left')
df3 = df1.merge(df2,how='left')
```
* 칼럼명이 동일한것 끼리 서로 연결이 됨
* 동일한 칼럼이 2개이상인 경우에도 AND 조건으로 다중요건 VLOOKUP가 된다
```
DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
* how{‘left’, ‘right’, ‘outer’, ‘inner’, ‘cross’}, default ‘inner’
```

In [55]:
# 두가지 방법으로 merge 가능
# df3 = pd.merge(df1,df2,how='left')
df3 = df1.merge(df2,how='left')
print(df3)

       이름        제품  가격
0    백철민    아이스티  4400
1    박태인  레몬에이드  4400
2    국지용  아메리카노  3900
3    강민석  레몬에이드  4400
4    박훈정    아이스티  4400
..      ...         ...   ...
369  김경남  아메리카노  3900
370  기정수      유자차  3500
371  기주봉    아이스티  4400
372  백승환  바닐라라떼  3900
373  계승현  레몬에이드  4400

[374 rows x 3 columns]

* 클립보드로 데이터프레임을 복사한다. 엑셀에서 CTL_V(붙여넣기) 해보라.!!

In [56]:
df3.to_clipboard(index=False)

In [57]:
df1 = pd.read_excel("../E02EXAMPLE.xlsx",sheet_name=1)
df2 = pd.read_excel("../E02EXAMPLE.xlsx",sheet_name=2)

In [63]:
df3 = df1.merge(df2,on=["업체","제품"],how="left")
df3

       이름        제품        업체  가격
0      백민  산채비빔밥  종가도시락  6700
1    권상우  치킨도시락  두솥도시락  6300
2    강인서  돈까스정식  두솥도시락  5700
3    백종민  산채비빔밥  두솥도시락  5200
4    권혁범  산채비빔밥  두솥도시락  5200
..      ...         ...         ...   ...
369  박민규  산채비빔밥  두솥도시락  5200
370  문영동  돈까스정식  두솥도시락  5700
371  백철민  돈까스정식  두솥도시락  5700
372  김두진  산채비빔밥  종가도시락  6700
373  김동수  돈까스정식  두솥도시락  5700

[374 rows x 4 columns]

In [64]:
df3.to_clipboard(index=False)

### COUNTIF, SUMIF 구현

In [12]:
import pandas as pd
df1 = pd.read_excel("../E03EXAMPLE.xlsx", sheet_name=1)
df2 = pd.read_excel("../E03EXAMPLE.xlsx", sheet_name=2)
df3 = df1.merge(df2,how='left')

In [24]:
df3

      이름    업체    메뉴  수량    가격
0    강민석   커피딘   스무디   1  4900
1    박충선   커피딘  카페라떼   1  4500
2    김보강   커피딘  아이스티   1  4200
3    김서경  스타카페  아이스티   1  4700
4    박지수   커피딘  아이스티   1  4200
..   ...   ...   ...  ..   ...
195  권혁호   커피딘   스무디   1  4900
196  박은석  스타카페  아이스티   1  4700
197  강인형   커피딘   스무디   1  4900
198  박찬우  스타카페  아이스티   1  4700
199  박재정   커피딘   스무디   1  4900

[200 rows x 5 columns]

* DataFrame.pivot_table
```
DataFrame.pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)
```

In [26]:
pdf1 = df3.pivot_table("수량",index=["업체","메뉴"],aggfunc="count")
# pdf1 = pd.pivot_table(df3,index=["업체","메뉴"],values=["수량"],aggfunc="count")
# pdf1 = pd.pivot_table(df3,values=["수량"],index=["업체","메뉴"],aggfunc=["count","sum"])

In [27]:
pdf1

          count sum
             수량  수량
업체   메뉴
스타카페 스무디     37  37
     아이스티    36  36
     카페라떼    26  26
커피딘  스무디     36  36
     아이스티    40  40
     카페라떼    25  25

In [29]:
pdf2 = df3.pivot_table("가격",index=["업체"],aggfunc="sum")
pdf2

          가격
업체
스타카페  462000
커피딘   456900

In [83]:
pdf1.to_clipboard(index=False)

In [84]:
pdf2.to_clipboard(index=False)

### 결측치처리

In [37]:
import pandas as pd
df1 = pd.read_excel("../E04EXAMPLE.xlsx", sheet_name=1)

In [34]:
# df1
df1.isnull()
# df1["점수"].isnull()

        이름     점수
0    False  False
1    False  False
2    False   True
3    False  False
4    False  False
..     ...    ...
295  False  False
296  False  False
297  False  False
298  False   True
299  False  False

[300 rows x 2 columns]

In [92]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      300 non-null    object
 1   점수      276 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.8+ KB

```
DataFrame.fillna(value=None, *, method=None, axis=None, inplace=False, limit=None, downcast=None)
* method : {‘backfill’, ‘bfill’, ‘pad’, ‘ffill’, None}, default None
* axis : {0 or ‘index’, 1 or ‘columns’}
* inplace : bool, default False

DataFrame.dropna(*, axis=0, how=_NoDefault.no_default, thresh=_NoDefault.no_default, subset=None, inplace=False)
```

In [38]:
df2 = df1.fillna(0)  # 결측치에 0 대입.
# df2 = df1["이름"].fillna(0)  # 결측치에 0 대입.
# df3 = df1.dropna()   # 결측치데이터 삭제
# df3_1 = df1.dropna(axis=1)   # 결측치데이터 칼럼삭제
df2

0      박용우
1      박주용
2      문종원
3      김대명
4      박남현
      ...
295    김병춘
296    마동석
297    공윤찬
298    강다빈
299    서지훈
Name: 이름, Length: 300, dtype: object

In [105]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      300 non-null    object
dtypes: object(1)
memory usage: 2.5+ KB

In [106]:
df2.to_clipboard(index=False)

In [107]:
df3.to_clipboard(index=False)

### IF

In [118]:
import pandas as pd
df = pd.read_excel("../E05EXAMPLE.xlsx",sheet_name=1)

In [121]:
df["승점"]= df["승"]*3 + df["무"]*1
df["골득실"] = df["득점"] -df["실점"]
df

         팀  경기  승  무  패  득점  실점  승점  골득실
0       UAE     4   0   3   1     3     4     3      -1
1  대한민국     4   2   2   0     6     3     8       3
2    시리아     4   0   1   3     4     8     1      -4
3      이란     4   3   1   0     6     2    10       4
4    이라크     4   0   3   1     4     5     3      -1
5    레바논     4   1   2   1     3     4     5      -1

In [122]:
df1= df.drop(["득점","실점"],axis=1)

In [124]:
df1.to_clipboard(index=False)

In [39]:
df = pd.read_excel("../E06EXAMPLE.xlsx",sheet_name=1)

In [40]:
cond1 = df["점수"].isnull()
df["참석여부"] = df["점수"].mask(cond1,"X").mask(~cond1,"o")

```
DataFrame.mask(cond, other=nan, *, inplace=False, axis=None, level=None, errors='raise', try_cast=_NoDefault.no_default)
```

In [46]:
cond2 = df["점수"] > 70 
cond3 = df["점수"] > 90
df["성적"] = df["점수"].mask(~cond2,"C").mask(cond2,"B").mask(cond3,"A")
df

      이름     점수 참석여부 성적
0    곽진무   98.0    o  A
1    김상엽    NaN    X  C
2    백재진    NaN    X  C
3    김상원  100.0    o  A
4    맹세창   82.0    o  B
..   ...    ...  ... ..
195  서준열   55.0    o  C
196  박지수    NaN    X  C
197  김범진   64.0    o  C
198  강민석    NaN    X  C
199  박지일   96.0    o  A

[200 rows x 4 columns]

In [ ]:
df.to_clipboard(index=False)